package ua.step.homework;

/*
 * Шаблон для решения домашнего задания 11. 
 */
/**
 * У Деда Мороза есть часы, которые в
 * секундах показывают сколько осталось до каждого Нового Года. Так как Дед
 * Мороз уже человек в возрасте, то некоторые математические операции он быстро
 * выполнять не в состоянии. Помогите Деду Морозу определить сколько полных
 * дней, часов, минут и секунд осталось до следующего Нового Года, если известно
 * сколько осталось секунд, т. е. разложите время в секундах на полное
 * количество дней, часов, минут и секунд. Выведите результат на консоль.
 *
 * Пример вывода если secondsToNewYear = 914733: 10 дней, 14 часов, 5 минут и 33 секунд
 */
public class Task11 {
    public static void main(String[] args) {
        int secondsToNewYear = 61;
        // данная строка нужна для автоматического теста (смотри Task11Test)
        secondsToNewYear = (args.length == 1) ? Integer.parseInt(args[0]) : secondsToNewYear;
        // используй переменную SECONDS_TO_NEW_YEAR для решения

        // FIXME: Здесь будет ваш код. Удалите эту строку после выполнения задания
    }
}